/*
비행기표 예매 사이트를 구축하기 위한 요구사항

<회원가입 Member>
- 회원은 아이디, 비밀번호, 이메일, 전화번호, 이름, 주소를 입력하여 회원가입을 한다.
- 회원 가입시 아이디는 중복체크를 하고, 전화번호를 통해 본인인증을 한다. 
- 반드시 회원 가입을 통해 비행기표를 구입할 수 있다.

- 비행기표 구입,취소,변경,환불은 회원만 가능하다.
- 회원 가입은 아이디, 비번, 전화번호, 생년월일를 입력하여 가입한다. 
- 회원은 회원과 관리자로 구분된다.

- 비행 등록은 관리자만 가능하다.
- 도서 등록시 도서명, 도서번호, 저자, 분류, 출판사를 입력하여 등록한다. 
- 분류는 도서분류로 3자리의 숫자로 구성된다. 
- 저자는 한번에 같이 입력(저자가 여러명이거나 저자, 옮긴이, 엮은이처럼 여러명인 경우 다 같이 저장)

- 회원은 도서번호를 이용하여 예약이 가능하다.
- 회원은 최대 3권의 도서를 대출할 수 있다. 

- 도서 연체시 연체 기간만큼 도서를 대출할 수 없다. 

- 예약된 도서는 최대 3일까지 예약으로 표시되고 이후에는 예약이 취소된다. 

- 예약은 대출가능한 도서나 대출중이지만 예약되지 않은 도서만 가능하다. 
- 특정 도서는 대출 여부에 상관없이 예약이 안된다. 
*/